adpyke.codesnap
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
dart-code.dart-code
dart-code.flutter
divyanshuagrawal.competitive-programming-helper
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot
github.copilot-chat
hediet.vscode-drawio
mechatroner.rainbow-csv
ms-azuretools.vscode-azureresourcegroups
ms-edgedevtools.vscode-edge-devtools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
ms-windows-ai-studio.windows-ai-studio
pkief.material-icon-theme
redhat.java
ritwickdey.liveserver
teamsdevapp.vscode-ai-foundry
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
xabikos.javascriptsnippets
xdebug.php-debug
xdebug.php-pack
zobo.php-intellisense
